resume.tex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{fullpage}
\usepackage[T1]{fontenc}
\usepackage[scaled]{helvet}
\renewcommand*\familydefault{\sfdefault}}
\providecommand{\alert}[1]{\textbf{#1}}

\title{}
%\author{}
\date{}

\begin{document}




\begin{center}
{\huge Richard P. Dillon} \\
4062 Valeta St. Unit 338 | San Diego, CA | 619.758.3547 | rpdillon@gmail.com
\hrule
\end{center}

\section*{Experience}
\label{sec-1}
\subsection*{Senior Software Engineer, Lockheed Martin Advanced Technologies, 2004--Present}
\label{sec-1_1}
\subsubsection*{Internal R\&D Prototyping For Genomic Data Management and Processing}
\label{sec-1_1_1}

    Technical lead for bioinformatics IR\&D working closely with
    UCSF and NIH scientists to develop cloud-based data
    compression and management platform.  Development ongoing.
\subsubsection*{Distributed Database Prototyping}
\label{sec-1_1_2}

    Developed a distributed track information database prototype for
    the Office of Naval Research. Prototype based on Apache Cassandra
    to create global shared information space for U.S. Navy use.
    Demonstrated on unreliable network and visualized with NASA
    Worldwind.
      
\subsubsection*{Augmented Reality Prototyping for DARPA ULTRA-Vis}
\label{sec-1_1_3}

    Developer on a team that prototyped a wearable, networked
    augmented reality system to enhance situational awareness for
    dismounted warfighters.  Developed sensor alignment algorithms and
    integrated hardware and software components from five partners;
    successfully demonstrated in the field to DARPA personnel in
    January 2010.
      
\subsubsection*{Unattended Wireless Sensor Network Data Routing}
\label{sec-1_1_4}

    Co-architected and developed distributed demand-based data routing
    algorithms based on learning classifier systems.  Successfully
    demonstrated 1000 nodes in unreliable network environment using
    simulation; demonstrated real-world application by porting and
    deploying to ten SunSPOTs. Co-authored paper and presented work at
    WorldComp ICWN 2008.
      
\subsubsection*{Genetic Algorithm Optimization and Supply Chain Simulation}
\label{sec-1_1_5}

    Lead developer on R\&D project to optimize global reverse supply
    chain logistics involving placement of facilities to collect GPS
    tracking units (tags) after use by customers.  Developed global tag
    routing simulation in Scala to calculate tag collection cost.
    Integrated Javaspaces-based distributed computing platform with
    genetic algorithms framework to perform search for optimal
    collection center placement on eight-node cluster. Cited by program
    manager as most successful of his R\&D efforts in 2008.
      
\subsubsection*{Cluster-based Network Simulation}
\label{sec-1_1_6}

    Co-developed cluster-based simulation environment to demonstrate
    scalability of distributed architecture for sensor data fusion.
    Integrated simulation code with replicated worker Javaspaces-based
    distribution framework to simulate 1300-node scenario using
    eight-node cluster. Presented network simulation techniques at 2005
    Jini Community Conference, Chicago, IL.
\subsection*{Division Officer, USS Boxer (LHD-4), United States Navy, 2001-2004}
\label{sec-1_2}

    Led a division of 60 sailors responsible for shipwide damage
    control.  Awarded two Navy Achievement Medals and cited as
    Commanding Officer's most trusted Officer of the Deck during three
    deployments to Arabian Gulf; responsible for conducting amphibious
    and helicopter operations in hostile waters off the coast of Iraq
    and Kuwait.
\section*{Awards, Articles and Presentations}
\label{sec-2}


\begin{itemize}
\item Presenter at 2011 Lockheed Martin Agile Software Engineering
    Workshop in Bethesda, MD
\item Nominated for the Lockheed Martin Executive Technical Roundtable
    Mentoring Program (2011)
\item Lockheed Martin Individual Special Recognition Award for work as
    project lead to optimize shipping logistics using genetic
    algorithms (2009)
\item Lockheed Martin Spot Award for research on wireless data routing
    algorithms (2008)
\item Presented paper at at WorldComp ICWN 2008: \emph{A Self-Organizing System for Regulating Data Flow through Highly Bandwidth-Constrained Wireless Sensor Networks}
\item Speaker at JavaOne 2007 on the \emph{Open-Source Java Projects: Meet     the Sausage Makers Panel}
\item Lockheed Martin Spot Award for integrating data fusion engine and
    distributed fusion management framework (2006)
\item Speaker at 2005 Jini Community Meeting: \emph{Using JavaSpaces to     Simulate Large-Scale Jini Service Networks}
\item Lockheed Martin Team Special Recognition Award for prototyping of
    distributed network resource allocation framework (2005)
\end{itemize}
\section*{Education}
\label{sec-3}


\begin{itemize}
\item \emph{Master of Computer Science} (GPA: 3.97), 2010 (North Carolina
    State University Raleigh, NC)
\item \emph{Bachelor of Science, Operations Research}, 2000 (Cornell
    University Ithaca, NY)
\end{itemize}
\section*{Technical Proficiencies}
\label{sec-4}


\begin{description}
\item[10000+ Hours:] Object-oriented programming, Distributed computing, Java,
    LPI-certified GNU/Linux systems administrator, GNU Emacs, Agile
    development (scrum)
\item[5000+ Hours:] Python, Public presentation, Concurrent systems,
    Simulation, Mac OS X, Jini 2/Apache River, Eclipse
\item[1000+ Hours:] Functional programming, Scala, Clojure, Javascript,
    Genetic algorithms, Distributed data structures, J2EE
    (JBoss/Glassfish), Rocks Clusters, \LaTeX{}
\end{description}

\end{document}
